app/Http/Controllers/FrontController.php

    public function index()
    {
        $blogs = Blog::where('publish_status',1)->take(12)->latest()->get();
        $clients = Clients::where('publish_status',1)->take(12)->latest()->get();
        $miniblog = Blog::where('publish_status',1)->take(8)->latest()->get();
        $project_list = Projects::where('publish_status',1)->latest()->get();
        $gallery = Projects::where('publish_status',1)->where('shown_on_gallery',1)->latest()->get();
        $pro_main = Projects::where('publish_status',1)->where('shown_on_main',1)->latest()->get();
---
select * from `blogs` where `publish_status` = 1 order by `created_at` desc limit 12
select * from `clients` where `publish_status` = 1 order by `created_at` desc limit 12
select * from `blogs` where `publish_status` = 1 order by `created_at` desc limit 8
select * from `projects` where `publish_status` = 1 order by `created_at` desc
select * from `projects` where `publish_status` = 1 and `shown_on_gallery` = 1 order by `created_at` desc
select * from `projects` where `publish_status` = 1 and `shown_on_main` = 1 order by `created_at` desc