app/Http/Controllers/ProgrammingLanguageController.php

     public function index()
    {
        $language = ProgrammingLanguage::latest()->get();
---
select * from `programming_languages` order by `created_at` desc

     public function store(Request $request)
    {
        $this->validate($request, [
            'title'    => 'required',
            'publish_status'=>'nullable'
        ]);

        $input = $request->all();
        $input['publish_status']=$request->publish_status?? 0;
        ProgrammingLanguage::create($input);
---
insert into `programming_languages` (`title`, `publish_status`, `updated_at`, `created_at`) values ('MongoDB', '1', '2025-10-19 19:03:23', '2025-10-19 19:03:23')

    public function edit($id)
    {
        $language = ProgrammingLanguage::findorFail($id);
---
select * from `programming_languages` where `programming_languages`.`id` = '9' limit 1

    public function update(Request $request, $id)
    {
        $this->validate($request, [
            'title'    => 'required',
            'publish_status'=>'nullable'
        ]);

        $input = $request->all();
        $input['publish_status']=$request->publish_status?? 0;
        ProgrammingLanguage::findOrFail($id)->update($input);
---
select * from `programming_languages` where `programming_languages`.`id` = '9' limit 1
update `programming_languages` set `title` = 'Node.js', `programming_languages`.`updated_at` = '2025-10-19 19:01:54' where `id` = 9