app/Http/Controllers/ProjectsController.php

select * from `projects` order by `created_at` desc limit 100 offset 0
select `programming_languages`.*, `project_programming_language`.`project_id` as `pivot_project_id`, `project_programming_language`.`programming_language_id` as `pivot_programming_language_id` from `programming_languages` inner join `project_programming_language` on `programming_languages`.`id` = `project_programming_language`.`programming_language_id` where `project_programming_language`.`project_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 50, 51)
select count(*) as aggregate from `projects`
---
    public function index()
    {
        $project = Projects::with('programmingLanguages')->latest()->paginate(100);

select * from `programming_languages` where `publish_status` = 1 order by `created_at` desc
---
    public function create()
    {
        $pro = ProgrammingLanguage::where('publish_status', 1)->latest()->get();

insert into `projects` (`title`, `link`, `github_link`, `year`, `made_at`, `description`, `meta_title`, `meta_keywords`, `meta_description`, `cover_image`, `banner_image`, `slug`, `publish_status`, `shown_on_main`, `shown_on_gallery`, `updated_at`, `created_at`) values ('Test', 'Quasi dolorem repreh', 'Voluptatum laudantiu', '1982', 'Autem molestiae prae', null, 'Pariatur Nulla odio', 'Ut nulla fugiat non', 'Deserunt dicta tempo', null, null, 'test', 0, 0, 0, '2025-10-19 18:52:17', '2025-10-19 18:52:17')
insert into `project_programming_language` (`programming_language_id`, `project_id`) values (4, 51)
---
    public function store(Request $request)
    {
        // dd($request->all());
        $this->validate($request, [
            'cover_image' => 'nullable|string|max:250',
            'banner_image' => 'nullable|string|max:250',
            'link' => 'nullable|string',
            'github_link' => 'nullable|string',
            'year' => 'nullable|string',
            'made_at' => 'nullable|string',
            'built_with' => 'nullable|array',
            'built_with.*' => 'exists:programming_languages,id',
            'title' => 'required',
            'description' => 'nullable',
            'meta_title' => 'nullable',
            'meta_keywords' => 'nullable',
            'meta_description' => 'nullable',
            'og_image' => 'nullable|string|max:250',
        ]);

        $input = $request->all();
        $input['slug'] = Str::slug($request->title);
        $input['publish_status'] = $request->publish_status ?? 0;
        $input['shown_on_main'] = $request->shown_on_main ?? 0;
        $input['shown_on_gallery'] = $request->shown_on_gallery ?? 0;

        $project = Projects::create($input);

        // Attach programming languages
        if ($request->has('built_with')) {
            $project->programmingLanguages()->sync($request->built_with);

select * from `programming_languages` where `publish_status` = 1 order by `created_at` desc
select * from `projects` where `projects`.`id` = '51' limit 1
select `programming_languages`.*, `project_programming_language`.`project_id` as `pivot_project_id`, `project_programming_language`.`programming_language_id` as `pivot_programming_language_id` from `programming_languages` inner join `project_programming_language` on `programming_languages`.`id` = `project_programming_language`.`programming_language_id` where `project_programming_language`.`project_id` in (51)
---
    public function edit(string $id)
    {
        $pro = ProgrammingLanguage::where('publish_status', 1)->latest()->get();
        $project = Projects::with('programmingLanguages')->findOrFail($id);

select * from `projects` where `projects`.`id` = '51' limit 1
update `projects` set `title` = 'ugiug', `slug` = 'ugiug', `projects`.`updated_at` = '2025-10-19 18:54:11' where `id` = 51
delete from `project_programming_language` where `project_programming_language`.`project_id` = 51 and `project_programming_language`.`programming_language_id` in (4)
insert into `project_programming_language` (`programming_language_id`, `project_id`) values (4, 42)
---
    public function update(Request $request, string $id)
    {
        $this->validate($request, [
            'cover_image' => 'nullable|string|max:250',
            'banner_image' => 'nullable|string|max:250',
            'link' => 'nullable|string|max:250',
            'github_link' => 'nullable|string',
            'year' => 'nullable|string',
            'made_at' => 'nullable|string',
            'built_with' => 'nullable|array',
            'built_with.*' => 'exists:programming_languages,id',
            'title' => 'required',
            'description' => 'nullable',
            'meta_title' => 'nullable',
            'meta_keywords' => 'nullable',
            'meta_description' => 'nullable',
            'og_image' => 'nullable|string|max:250',
        ]);

        $input = $request->all();
        $input['slug'] = Str::slug($request->title);
        $input['publish_status'] = $request->publish_status ?? 0;
        $input['shown_on_main'] = $request->shown_on_main ?? 0;
        $input['shown_on_gallery'] = $request->shown_on_gallery ?? 0;

        $project = Projects::findOrFail($id);
        $project->update($input);

        // Sync programming languages
        if ($request->has('built_with')) {
            $project->programmingLanguages()->sync($request->built_with);

select * from `projects` where `projects`.`id` = '44' limit 1
delete from `projects` where `id` = 44
---
    public function destroy(string $id)
    {
        $project = Projects::findOrFail($id);
        $project->delete();