app/Models/Projects.php

select `programming_languages`.*, `project_programming_language`.`project_id` as `pivot_project_id`, `project_programming_language`.`programming_language_id` as `pivot_programming_language_id` from `programming_languages` inner join `project_programming_language` on `programming_languages`.`id` = `project_programming_language`.`programming_language_id` where `project_programming_language`.`project_id` = 50
---
    public function getBuiltWithAttribute()
    {
        return $this->programmingLanguages->pluck('id')->toArray();